{
    "sceneDescription": "The player wakes up on the boat and meets Jiub for the first time.",
    "nodes": [
        {
            "nodeID": 101,
            "location": "Prison Boat",
            "description": "Jiub greets the player when they wake up on the boat.",
            "paragraphs": [
                {
                    "narration": true,
                    "speaker": null,
                    "text": "You are dreaming. Visions of a far away land and silhouettes of strange creatures flicker before your mind's eye. Falling into the deepest sleep, the uneasy silence is broken by a mysterious voice, speaking as if a million miles away yet right by your side."
                },
                {
                    "narration": false,
                    "speaker": "Mysterious Voice",
                    "text": "They have taken you from the Imperial City's prison, first by carriage, and now by boat. To the east, to Morrowind. Fear not, for I am watchful. You have been chosen."
                },
                {
                    "narration": true,
                    "speaker": null,
                    "text": "As you begin to regain consciousness, you can feel your body aching. Your bare elbows are bruised, and you find yourself lying half bent over a wooden crate, which is probably where you spent the night. The room around you seems to rock back and forth, and you can hear the sound of water breaking against the walls. As you open your eyes, the grovelly voice of a stranger beckons to you."
                },
                {
                    "narration": false,
                    "speaker": "Jiub",
                    "text": "Wake Up. We're Here. Why are you shaking? Are you ok? Wake up. Stand up. There you go. You were dreaming. What's your name?"
                }
            ],
            "responses": [
                {
                    "text": "I'm not sure. Everything is...foggy.",
                    "nextNode": 1
                },
                {
                    "text": "My name is Sadrayn. And you are...?",
                    "nextNode": 2
                },
                {
                    "text": "I'm not telling you my name. I'm not sure I can trust you.",
                    "nextNode": 3
                },
                {
                    "text": "Why, I'm Lord Nerevar, of course! Don't you recognize me?",
                    "nextNode": 4
                }
            ]
        },
        {
            "nodeID": 102,
            "location": "Prison Boat",
            "description": "The player has been acquainted with Jiub, who informs them they've reached Morrowind.",
            "paragraphs": [
                {
                    "narration": false,
                    "speaker": "Jiub",
                    "text": "Well, not even last night's storm could wake you. I heard them say we've reached Morrowind, I'm sure they'll let us go..."
                },
                {
                    "narration": true,
                    "speaker": null,
                    "text": "The man looks over his shoulder, and sees a prison guard coming down the hall, with one hand on his key ring and the other on the pommel of a dagger in his belt."
                },
                {
                    "narration": false,
                    "speaker": "Prison Guard",
                    "text": "This is where you get off. Come with me."
                },
                {
                    "narration": true,
                    "speaker": null,
                    "text": "The guard brushes past your fellow traveller, barely acknowledging his presence, and grabs you by the handcuffs."
                }
            ],
            "responses": [
                {
                    "text": "Where are you taking me?",
                    "nextNode": null
                },
                {
                    "text": "Finally. I can't wait to get out of this hellhole.",
                    "nextNode": null
                },
                {
                    "text": "What about him? Is he free to go as well?",
                    "nextNode": null
                }
            ]
        },
        {
            "nodeID": 103,
            "location":"Prison Boat",
            "description": "Jiub greets the player and tells him his name.",
            "paragraphs":[
                {
                    "narration": false,
                    "speaker": "Jiub",
                    "text": "I'm Jiub. I came here from the mainland, same as you. Although, I'd prefer not to talk about what for."
                }
            ],
            "responses": [
                {
                    "text": "I see. Well, it's all in the past now, I won't try to pry. But speaking of the present...do you know where we are?",
                    "nextNode": null
                }
            ]
        },
        {
            "nodeID": 104,
            "location":"Prison Boat",
            "description": "The player tells Jiub that they don't trust him yet, and won't tell him their name.",
            "paragraphs": [
                {
                    "narration": false,
                    "speaker": "Jiub",
                    "text": "That's fair enough. I'd forgive you for suspecting you're not in good company. You have my word that I won't try to steal your rations in your sleep, but then again, my word might not mean a lot to you."
                }
            ],
            "responses": [
                {
                    "text": "You sound like the decent enough sort. Sorry if I came off a little...hostile. It hasn't been an easy trip, and I'm a little on the edge.",
                    "nextNode": null
                },
                {
                    "text": "Fair enough, but I'm watching you. Don't try anything funny.",
                    "nextNode": null
                },
                {
                    "text": "Nothing personal, I just don't feel like getting too well acquainted seeing as we'll probably hang tomorrow.",
                    "nextNode": null
                }
            ]
        },
        {
            "nodeID": 105,
            "location": "Prison Boat",
            "description": "The player has just informed Jiub that they are Lord Nerevar, and Jiub is not amused.",
            "paragraphs": [
                {
                    "narration": false,
                    "speaker": "Jiub",
                    "text": "Hit your head on the way here, did you? I'm not in the mood for your delusional rambling. Keep it to yourself."
                }
            ],
            "responses": [
                {
                    "text": "How dare you? I'll have your tongue for disrespecting me like that!",
                    "nextNode": null
                },
                {
                    "text": "Relax, I'm kidding. My head is just fine, thank you.",
                    "nextNode": null
                },
                {
                    "text": "Damn, did someone piss in your coffee this morning? You're crankier than a road lizard.",
                    "nextNode": null
                }
            ]
        }
    ]
}